[
  {
    "personId":         "Adam (-)",
    "eventName":        "Creation and Placement in Eden",
    "jasherReference":  "Jasher 1:1-3",
    "description":      "God formed Adam from the dust of the earth and breathed into his nostrils the breath of life. Adam was placed in the Garden of Eden to dress it and keep it, with dominion over all living creatures.",
    "relatedPersonIds": [
      "Eve (wife Adam)"
    ]
  },
  {
    "personId":         "Eve (wife Adam)",
    "eventName":        "Creation from Adam's Rib",
    "jasherReference":  "Jasher 1:4-5",
    "description":      "God caused a deep sleep to fall upon Adam and took one of his ribs to form woman. Adam called her Eve because she was the mother of all living. They were both naked and not ashamed.",
    "relatedPersonIds": [
      "Adam (-)"
    ]
  },
  {
    "personId":         "Adam (-)",
    "eventName":        "The Fall and Expulsion from Eden",
    "jasherReference":  "Jasher 1:6-8",
    "description":      "After eating from the tree of knowledge of good and evil, Adam and Eve's eyes were opened and they knew they were naked. God expelled them from the Garden of Eden, lest they eat from the tree of life and live forever.",
    "relatedPersonIds": [
      "Eve (wife Adam)"
    ]
  },
  {
    "personId":         "Cain (Adam)",
    "eventName":        "Birth and Early Life as a Tiller",
    "jasherReference":  "Jasher 1:9-11",
    "description":      "Cain was the firstborn of Adam and Eve. He became a tiller of the ground, while his brother Abel became a keeper of sheep. Cain brought an offering of the fruit of the ground to the Lord.",
    "relatedPersonIds": [
      "Abel (Adam)",
      "Adam (-)",
      "Eve (wife Adam)"
    ]
  },
  {
    "personId":         "Abel (Adam)",
    "eventName":        "Abel's Righteous Offering",
    "jasherReference":  "Jasher 1:12-14",
    "description":      "Abel became a keeper of sheep and brought the firstlings of his flock as an offering to the Lord. God had respect for Abel and his offering, which kindled Cain's jealousy and anger against his brother.",
    "relatedPersonIds": [
      "Cain (Adam)",
      "Adam (-)",
      "Eve (wife Adam)"
    ]
  },
  {
    "personId":         "Cain (Adam)",
    "eventName":        "The Quarrel and Murder of Abel",
    "jasherReference":  "Jasher 1:15-25",
    "description":      "Jasher recounts a detailed dialogue that preceded the murder. The quarrel was not only about the offering but escalated into a physical fight in which Cain used a piece of a plow to kill Abel, because he did not know how to get his soul out of him.",
    "relatedPersonIds": [
      "Abel (Adam)"
    ]
  },
  {
    "personId":         "Adam (-)",
    "eventName":        "Mourning for Abel",
    "jasherReference":  "Jasher 1:26",
    "description":      "After Abel's murder, Adam and Eve mourned intensely. According to Jasher, Adam did not know his wife for 130 years, until the birth of Seth, who would continue the line of humanity.",
    "relatedPersonIds": [
      "Eve (wife Adam)",
      "Abel (Adam)",
      "Cain (Adam)",
      "Seth (Adam)"
    ]
  },
  {
    "personId":         "Seth (Adam)",
    "eventName":        "Birth as Replacement for Abel",
    "jasherReference":  "Jasher 1:27-28",
    "description":      "After 130 years of mourning, Adam knew his wife again and she bore Seth. Adam said God had appointed another seed instead of Abel, whom Cain had slain. Seth was born in Adam's own likeness and image.",
    "relatedPersonIds": [
      "Adam (-)",
      "Eve (wife Adam)",
      "Abel (Adam)",
      "Cain (Adam)"
    ]
  },
  {
    "personId":         "Cain (Adam)",
    "eventName":        "Exile and Building the City of Enoch",
    "jasherReference":  "Jasher 1:29-31",
    "description":      "After killing Abel, Cain was cursed to be a fugitive and wanderer. He went to the land of Nod and knew his wife, who bore Enoch. Cain built a city and called it after his son's name, Enoch.",
    "relatedPersonIds": [
      "Enoch (Cain)"
    ]
  },
  {
    "personId":         "Enos (Seth)",
    "eventName":        "Beginning to Call Upon the Lord",
    "jasherReference":  "Jasher 2:1-3",
    "description":      "In the days of Enos, son of Seth, men began to call upon the name of the Lord. This marked the beginning of formal worship and prayer among mankind, establishing a tradition of seeking God.",
    "relatedPersonIds": [
      "Seth (Adam)",
      "Adam (-)"
    ]
  },
  {
    "personId":         "Adam (-)",
    "eventName":        "The Garments of Light",
    "jasherReference":  "Jasher 7:24-25",
    "description":      "According to Jasher, God made not only garments of animal skins for Adam and Eve, but garments that gave them special power and authority. These garments were passed down and gave power to the wearer. Nimrod eventually obtained them through Ham, which contributed to his power.",
    "relatedPersonIds": [
      "Eve (wife Adam)",
      "Ham (Noah)",
      "Nimrod (Cush)"
    ]
  },
  {
    "personId":         "Enoch (Jared)",
    "eventName":        "King and Teacher of Humanity",
    "jasherReference":  "Jasher 3",
    "description":      "In Jasher, Enoch is described not only as pious but also as a righteous king who ruled humanity for 243 years. He taught them wisdom, knowledge, and the ways of God, leading to peace and order on earth.",
    "relatedPersonIds": [
      "Methuselah (Enoch)"
    ]
  },
  {
    "personId":         "Enoch (Jared)",
    "eventName":        "Ascension into Heaven",
    "jasherReference":  "Jasher 3:36-38",
    "description":      "His ascension is described in detail. He was taken up into heaven on a fiery horse before the eyes of many witnesses, including his son Methuselah, which left a deep impression and confirmed his teachings.",
    "relatedPersonIds": [
      "Methuselah (Enoch)"
    ]
  },
  {
    "personId":         "Lamech (Methuselah)",
    "eventName":        "The Miraculous Birth of Noah",
    "jasherReference":  "Jasher 4:14-16",
    "description":      "Jasher tells of Lamech's astonishment and fear at the birth of Noah, who looked extraordinary and wise. He feared that the child was from the 'sons of God,' but his father Methuselah reassured him that Noah came from his line and was destined to save humanity.",
    "relatedPersonIds": [
      "Noah (Lamech)",
      "Methuselah (Enoch)"
    ]
  },
  {
    "personId":         "Noah (Lamech)",
    "eventName":        "Preaching Against Corruption",
    "jasherReference":  "Jasher 5:14-20",
    "description":      "Noah preached repentance for 120 years to a generation that was extremely corrupt. Jasher describes how they interbred humans and animals of different kinds and how the 'sons of God' (fallen angels) took human women, which led to God's judgment.",
    "relatedPersonIds": []
  },
  {
    "personId":         "Noah (Lamech)",
    "eventName":        "The Drunkenness and Curse on Canaan",
    "jasherReference":  "Jasher 7:28-39",
    "description":      "Jasher describes that Ham not only saw his father's nakedness but also stole Adam's garments that Noah had preserved. He later gave them to his son Cush. Noah cursed Canaan, Ham's son, because of this disrespectful act.",
    "relatedPersonIds": [
      "Ham (Noah)",
      "Canaan (Ham)",
      "Cush (Ham)"
    ]
  },
  {
    "personId":         "Nimrod (Cush)",
    "eventName":        "Rise as a Tyrant with Adam's Garments",
    "jasherReference":  "Jasher 7:42-50",
    "description":      "Nimrod, son of Cush, became a mighty hunter and king after he obtained Adam's garments. These garments gave him success in hunting and in battle, causing people to follow him and enabling him to establish the kingdom of Babel.",
    "relatedPersonIds": [
      "Cush (Ham)",
      "Esau (Isaac)"
    ]
  },
  {
    "personId":         "Abraham (Terah)",
    "eventName":        "Destruction of Terah's Idols",
    "jasherReference":  "Jasher 11-12",
    "description":      "At the age of 50, Abram destroys the idols in the house of his father Terah. He places an axe in the hand of the largest idol to mock their powerlessness. This act leads to his confrontation with King Nimrod.",
    "relatedPersonIds": [
      "Terah (Nahor)",
      "Nimrod (Cush)"
    ]
  },
  {
    "personId":         "Abraham (Terah)",
    "eventName":        "Nimrod's Fiery Furnace",
    "jasherReference":  "Jasher 12:20-40",
    "description":      "After Abram destroyed the idols, King Nimrod had him cast into a fiery furnace. God miraculously saved Abram before the eyes of the entire court. His brother Haran, who doubted, was also cast into the fire and died.",
    "relatedPersonIds": [
      "Nimrod (Cush)",
      "Haran (Terah)",
      "Lot (Haran)"
    ]
  },
  {
    "personId":         "Abraham (Terah)",
    "eventName":        "War with the Four Kings",
    "jasherReference":  "Jasher 13-14",
    "description":      "Abram leads his 318 trained men to rescue his nephew Lot from Kedorlaomer and his allied kings, including Nimrod (who is called Amraphel here). Jasher describes a strategic night attack resulting in a decisive victory.",
    "relatedPersonIds": [
      "Lot (Haran)",
      "Nimrod (Cush)"
    ]
  },
  {
    "personId":         "Isaac (Abraham)",
    "eventName":        "The Binding (Akedah)",
    "jasherReference":  "Jasher 23",
    "description":      "Jasher emphasizes that Isaac, at 37 years old, was fully aware of God's command and willingly agreed to it. Along the way, Satan tried to stop them both by creating a large river, but they persevered in their faith.",
    "relatedPersonIds": [
      "Abraham (Terah)",
      "Sarah (Abraham)"
    ]
  },
  {
    "personId":         "Esau (Isaac)",
    "eventName":        "Murder of Nimrod and Sale of Birthright",
    "jasherReference":  "Jasher 27:1-12",
    "description":      "According to Jasher, Esau sold his birthright after returning home exhausted from killing the tyrant Nimrod. He had ambushed Nimrod and two of his men. He feared for his life and at that moment placed no value on the birthright.",
    "relatedPersonIds": [
      "Jacob (Isaac)",
      "Nimrod (Cush)"
    ]
  },
  {
    "personId":         "Jacob (Isaac)",
    "eventName":        "Obtaining the Blessings",
    "jasherReference":  "Jasher 27-28",
    "description":      "At the urging of his mother Rebekah, Jacob disguises himself as Esau to receive the blessing of the birthright from his blind father Isaac. Jasher adds that God sent angels to prevent Esau from returning from the hunt in time.",
    "relatedPersonIds": [
      "Isaac (Abraham)",
      "Rebekah (Bethuel)",
      "Esau (Isaac)"
    ]
  },
  {
    "personId":         "Jacob (Isaac)",
    "eventName":        "Wars Against the Canaanite Kings",
    "jasherReference":  "Jasher 37-38",
    "description":      "After the events in Shechem, the Canaanite kings unite against Jacob and his family. Jasher describes extensive and successful wars waged by Jacob and his sons, which established their reputation as formidable warriors in the land.",
    "relatedPersonIds": [
      "Judah (Jacob)",
      "Simeon (Jacob)",
      "Levi (Jacob)"
    ]
  },
  {
    "personId":         "Joseph (Jacob)",
    "eventName":        "Joseph and Zuleika, Potiphar's Wife",
    "jasherReference":  "Jasher 44-45",
    "description":      "Jasher gives a name to Potiphar's wife: Zuleika. Her attempts to tempt Joseph are described in great detail, including a banquet where she invited her friends, who cut their fingers with fruit knives, distracted by Joseph's beauty.",
    "relatedPersonIds": [
      "Potiphar (-)"
    ]
  },
  {
    "personId":         "Joseph (Jacob)",
    "eventName":        "The Test with the Cup",
    "jasherReference":  "Jasher 53-54",
    "description":      "Joseph tests his brothers by placing his silver cup in Benjamin's sack. The ensuing confrontation, with Judah's passionate plea, convinces Joseph of their genuine repentance and change of heart.",
    "relatedPersonIds": [
      "Judah (Jacob)",
      "Benjamin (Jacob)"
    ]
  },
  {
    "personId":         "Judah (Jacob)",
    "eventName":        "Plea for Benjamin",
    "jasherReference":  "Jasher 54",
    "description":      "Jasher describes Judah's wrath and plea for Benjamin with great intensity. He roars like a lion, causing the walls of Egypt to shake, and threatens to destroy the land if Benjamin is not released. This forces Joseph to reveal his identity.",
    "relatedPersonIds": [
      "Joseph (Jacob)",
      "Benjamin (Jacob)"
    ]
  },
  {
    "personId":         "Moses (Amram)",
    "eventName":        "King of Cush (Ethiopia)",
    "jasherReference":  "Jasher 72-76",
    "description":      "Jasher fills in the 'hidden years' of Moses' life. After his flight from Egypt, he traveled to Cush, where he became their general in a nine-year war. After the victory, the Cushites made him their king for 40 years.",
    "relatedPersonIds": []
  },
  {
    "personId":         "Moses (Amram)",
    "eventName":        "The Miraculous Staff",
    "jasherReference":  "Jasher 77, 79",
    "description":      "The staff Moses used, according to Jasher, had a miraculous history. It was made of sapphire, engraved with God's name, and passed down through the patriarchs. Jethro took it to Midian, planted it in his garden, and only Moses was able to pull it out, proving he was the chosen one.",
    "relatedPersonIds": [
      "Jethro (-)"
    ]
  },
  {
    "personId":         "David (Jesse)",
    "eventName":        "Battle with Goliath",
    "jasherReference":  "Not in Jasher (ends with Joshua), but a key event in Samuel.",
    "description":      "The young shepherd David defeats the giant Philistine champion Goliath with a single stone from his sling. This act of faith in God catapults him to national hero status and brings him to the court of King Saul.",
    "relatedPersonIds": [
      "Goliath (-)",
      "Saul (-)"
    ]
  },
  {
    "personId":         "David (Jesse)",
    "eventName":        "Friendship and Covenant with Jonathan",
    "jasherReference":  "Not in Jasher.",
    "description":      "David forms a deep, unbreakable bond of friendship with Jonathan, the son of King Saul. Jonathan risks his life and his succession to the throne to protect David from his father's murderous jealousy.",
    "relatedPersonIds": [
      "Jonathan (Saul)",
      "Saul (-)"
    ]
  }
]

