[
  {
    "eventName":          "Creation of Adam",
    "dateAM":             0,
    "dateBCEstimate":     4004,
    "keyFigures":         [
      "Adam (-)",
      "Eva (-)"
    ],
    "scriptureReference": "Genesis 1-2",
    "description":        "God creates the heavens, the earth, and all life. On the sixth day, He creates Adam, the first man, in His own image. This event marks Year 0 in the Anno Mundi (AM) calendar, a system based on biblical genealogies."
  },
  {
    "eventName":          "The Fall of Man",
    "dateAM":             1,
    "dateBCEstimate":     4003,
    "keyFigures":         [
      "Adam (-)",
      "Eva (-)",
      "Satan"
    ],
    "scriptureReference": "Genesis 3",
    "description":        "Tempted by the serpent, Adam and Eva disobey God's command not to eat from the tree of the knowledge of good and evil. This act introduces sin and death into the world, resulting in their expulsion from the Garden of Eden."
  },
  {
    "eventName":          "Birth of Seth",
    "dateAM":             130,
    "dateBCEstimate":     3874,
    "keyFigures":         [
      "Adam (-)",
      "Eva (-)",
      "Seth (Adam)"
    ],
    "scriptureReference": "Genesis 5:3",
    "description":        "After Kain murders Abel, Seth is born to Adam and Eva when Adam is 130 years old. Seth's lineage is the line through which humanity is preserved and from which Noach descends."
  },
  {
    "eventName":          "The Great Flood",
    "dateAM":             1656,
    "dateBCEstimate":     2348,
    "keyFigures":         [
      "Noah (Lamech)",
      "Shem (Noah)",
      "Ham (Noah)",
      "Japheth (Noah)"
    ],
    "scriptureReference": "Genesis 6-9",
    "description":        "Due to widespread human wickedness, God sends a global flood. Noach is instructed to build an ark to save his family and pairs of every kind of animal. The flood begins in the 600th year of Noach's life and reshapes the world."
  },
  {
    "eventName":          "The Tower of Babel",
    "dateAM":             1757,
    "dateBCEstimate":     2247,
    "keyFigures":         [
      "Nimrod"
    ],
    "scriptureReference": "Genesis 11:1-9",
    "description":        "Humanity, speaking a single language, attempts to build a tower to reach the heavens in the land of Sinear. God confuses their languages and scatters them across the face of the earth. This event occurs during the lifetime of Peleg."
  },
  {
    "eventName":          "Birth of Abram",
    "dateAM":             2008,
    "dateBCEstimate":     1996,
    "keyFigures":         [
      "Abraham (Terah)",
      "Terah (Nahor)"
    ],
    "scriptureReference": "Genesis 11:26",
    "description":        "Abram is born in Ur of the Chaldees. God would later change his name to Abraham and choose him to be the father of a multitude of nations."
  },
  {
    "eventName":          "The Abrahamic Covenant",
    "dateAM":             2083,
    "dateBCEstimate":     1921,
    "keyFigures":         [
      "Abraham (Terah)",
      "God"
    ],
    "scriptureReference": "Genesis 12, 15, 17",
    "description":        "God calls Abram to leave his home and go to a land He will show him. God makes a covenant with Abraham, promising him numerous descendants, the land of Canaan, and that through him all the nations of the earth would be blessed. This occurs when Abraham is 75."
  },
  {
    "eventName":          "Destruction of Sodom and Gomorrah",
    "dateAM":             2107,
    "dateBCEstimate":     1897,
    "keyFigures":         [
      "Abraham (Terah)",
      "Lot",
      "Angels"
    ],
    "scriptureReference": "Genesis 18-19",
    "description":        "Due to their great wickedness, God destroys the cities of Sodom and Gomorrah with fire and brimstone. Abraham's nephew, Lot, and his two daughters are rescued just before the destruction."
  },
  {
    "eventName":          "Birth of Isaac",
    "dateAM":             2108,
    "dateBCEstimate":     1896,
    "keyFigures":         [
      "Abraham (Terah)",
      "Sarah (Terah)",
      "Isaac (Abraham)"
    ],
    "scriptureReference": "Genesis 21:1-7",
    "description":        "Isaac is born to Abraham and Sarah in their old age, fulfilling God's promise. Abraham is 100 years old and Sarah is 90 when Isaac is born, demonstrating God's power to fulfill His promises."
  },
  {
    "eventName":          "The Binding of Isaac",
    "dateAM":             2133,
    "dateBCEstimate":     1871,
    "keyFigures":         [
      "Abraham (Terah)",
      "Isaac (Abraham)",
      "God"
    ],
    "scriptureReference": "Genesis 22",
    "description":        "God tests Abraham by commanding him to sacrifice his son Isaac. Abraham obeys, but at the last moment, God provides a ram as a substitute sacrifice, demonstrating both Abraham's faith and God's provision."
  },
  {
    "eventName":          "Death of Sarah",
    "dateAM":             2145,
    "dateBCEstimate":     1859,
    "keyFigures":         [
      "Sarah (Terah)",
      "Abraham (Terah)"
    ],
    "scriptureReference": "Genesis 23",
    "description":        "Sarah dies at age 127 in Hebron. Abraham purchases the cave of Machpelah from Ephron the Hittite as a burial place for Sarah, marking the first piece of the Promised Land that Abraham actually owns."
  },
  {
    "eventName":          "Marriage of Isaac and Rebekah",
    "dateAM":             2148,
    "dateBCEstimate":     1856,
    "keyFigures":         [
      "Isaac (Abraham)",
      "Rebekah (Bethuel)",
      "Abraham (Terah)"
    ],
    "scriptureReference": "Genesis 24",
    "description":        "Abraham sends his servant to find a wife for Isaac from his own relatives. The servant finds Rebekah, daughter of Bethuel and granddaughter of Nahor (Abraham's brother), and she agrees to marry Isaac."
  },
  {
    "eventName":          "Birth of Jacob and Esau",
    "dateAM":             2168,
    "dateBCEstimate":     1836,
    "keyFigures":         [
      "Isaac (Abraham)",
      "Rebekah (Bethuel)",
      "Jacob (Isaac)",
      "Esau (Isaac)"
    ],
    "scriptureReference": "Genesis 25:19-26",
    "description":        "After Isaac prays for his barren wife, Rebekah conceives twins. The twins struggle in the womb, and God tells Rebekah that two nations are in her womb and the older will serve the younger. Esau is born first, followed by Jacob grasping his heel."
  },
  {
    "eventName":          "Jacob's Dream at Bethel",
    "dateAM":             2208,
    "dateBCEstimate":     1796,
    "keyFigures":         [
      "Jacob (Isaac)",
      "God"
    ],
    "scriptureReference": "Genesis 28:10-22",
    "description":        "Fleeing from Esau after stealing his blessing, Jacob dreams of a ladder reaching to heaven with angels ascending and descending. God appears to Jacob and confirms the covenant made with Abraham and Isaac."
  },
  {
    "eventName":          "Jacob Wrestles with God",
    "dateAM":             2228,
    "dateBCEstimate":     1776,
    "keyFigures":         [
      "Jacob (Isaac)",
      "God"
    ],
    "scriptureReference": "Genesis 32:22-32",
    "description":        "On his way back to Canaan to meet Esau, Jacob wrestles with a divine being all night at the Jabbok River. The being changes Jacob's name to Israel, meaning 'he who strives with God,' marking his transformation."
  },
  {
    "eventName":          "Joseph Sold into Slavery",
    "dateAM":             2276,
    "dateBCEstimate":     1728,
    "keyFigures":         [
      "Joseph (Jacob)",
      "Jacob (Isaac)"
    ],
    "scriptureReference": "Genesis 37",
    "description":        "Jealous of their father's favoritism toward Joseph and angered by his dreams, Joseph's brothers sell him to Midianite merchants. They deceive Jacob into believing Joseph was killed by a wild animal."
  },
  {
    "eventName":          "Joseph Becomes Vizier of Egypt",
    "dateAM":             2289,
    "dateBCEstimate":     1715,
    "keyFigures":         [
      "Joseph (Jacob)",
      "Pharaoh"
    ],
    "scriptureReference": "Genesis 41",
    "description":        "After interpreting Pharaoh's dreams about seven years of plenty followed by seven years of famine, Joseph is appointed as vizier of Egypt at age 30. He oversees the storage of grain during the years of abundance to prepare for the coming famine."
  }
]
